package com.patternJava.structural.proxy.proxy_1;

/*
        ШАБЛОН
        Проксі / Замісник ( Proxy )

        ============================================================================================
        ЦІЛЬ:
        - для заміщення другого обєкту і контролю доступу до нього.

        ============================================================================================
        ДЛЯ ЧОГО ВИКОРИСТОВУЄТЬСЯ:
        - для забезпечення контролю доступу до потрібного обєкту

        ============================================================================================
        ПРИКЛАД ВИКОРИСТАННЯ:
        - коли є потреба зсилатися на обєкт способом, який відрізняється від звичайног показника:
            + віддалене заміщення  -    локальний представник замість обєкта в іншому
                                        адресному просторі.

            + віртуальне заміщення -    створення "тяжких" обєктів при необхідності.

            + безпечне заміщення   -    контроль доступу до вказаног обєкту.

            + "розумна" силка      -    заміна звичайного вказівника
                                        (підрахунок числа силок, установка блокувальника ...)

        ============================================================================================
*/

public class ProxyMain {
    public static void main(String[] args) {
        Project project = new RealProject("https://github.com/nazarchykur/patternJava");
        project.run();

        Project project2 = new ProxyProject("https://github.com/nazarchykur/patternJava");
        // project will load only after call method run()
        project2.run();
    }
}
