package com.patternJava.creational.builder.builder_1;
/*
Б
шаблон: Будівельник (Builder)

====================
Ціль:

удівельник — це породжувальний патерн проектування,
що дає змогу створювати складні об’єкти крок за кроком.
Будівельник дає можливість використовувати один і той самий код
будівництва для отримання різних відображень об’єктів.

==========================
для чого використовується:

для створення різних обєктів з одного набору даних

=================================
приклад використання:

    - порядок створення складного обєкта не повинен залежати від того із яких частин складається обєкт
    і того як ці обєкти взаємозвязані
    - процес створення обєкту повинен представляти різні предаставлення обєкту який ми конструюємо

* */
public class Builder {
    public static void main(String[] args) {
        Director director = new Director();
        director.setBuilder(new EnterpriceWebsiteBuilder());
        Website website = director.buildWebsite();

        System.out.println(website);

    }
}
