package com.patternJava.structural.adapter.adapter_2;

/*
шаблон Адаптер ( Adapter )

=====================================================================
ЦІЛЬ :
    - перетворити інтерфейс одного класу у інтерфейс того класу, який потрібний клієнту
=====================================================================
Для чого використовується:
    - для забезпечення спільної роботи класів, інтерфейси яких не сувмістимі
=====================================================================
Приклад використання:
   - інтерфейс класу, який ми хочемо використовувати не відповідає нашим потребам;
   - потрібний клас, який повинен взаємодіяти з класами, які йому не відомі або не звязані з ним;
   - потрібно використовувати кілька існуючих підкласів, але не вигідно використовувати
     методи цих класів, створюючи їх нові підкласи
=====================================================================

 */
public class AdapterEx {
    public static void main(String[] args) {
        Database database = new JavaToDatabaseAdapter();

        database.insert();
        database.select();
        database.update();
        database.remove();
    }

}
