package com.patternJava.creational.abstractFactory.abstractFactory_1;
/*
шаблон: абстрактна фабрика

====================
Ціль:

створення інтерфейсу, для створення безлічі взаємозвязаних або взямозалежних обєктів без
жорсткої привязки до конкретних класів
==========================
для чого використовується:

для створення безлічі взаємозвязаних обєктів

=================================
приклад використання:

    - система не повиннна залежати від метода створення, компонування і преставлення вхідних в неї обєктів;
    - вхідні взаємозвязані обєкти повинні використовуватися разом;
    - система повинна конфігуруватися одним і безлічі обєктів з яких вана складається
    - нам потрібно преставити безліч обєктів розкриваючи тільки їхні інтерфейси а не реалізацію
*/

public class AbstractFactory {
    public static void main(String[] args) {

    }
}
