package com.patternJava.behavioral.state.state_3;
/*

1) інтерфейс Station - це стан, який має 3 реалізації      
   кожна з яких просто грає свою станцію

2) контекстний клас Radio через агрегацію має поле Station
   , де визначені ще два основні методи
     - сеттер метод встановлення стану
     - метод nextStation, який якраз і переключає стани 
        (він має визначену скінченну кількість станів, між якими переключаємося)
     
   а третій метод play() у контекстному класі просто делегує виклик на станцію,
   який буде грати в залежності від свого стану якусь станцію  
   
3) тобто за допомогою контекстного класу 
    -1) ми встановлюємо станцію
    -2) її граємо
    -3) можемо переключити на наступну станцію і включити її
    
    метод play() виконую ту саму дію, але через своє поле Station
    ми змінюємо стан, бо підставляємо різні імплементації Station
     = тобто переключаємося між станціями і цей метод грає різне
    
    nextStation() - метод який переключається між імплементаціями Station.
      перевіряє який зараз стан і включає наступний від нього стан

 */
public class StateMain {
    public static void main(String[] args) {
        Station station = new UAStation();
        
        Radio radio = new Radio();
        radio.setStation(station); // встановлюємо станцію
        // встановивши станцію викликаємо її програвати
        radio.play(); // radio UA paying...

        radio.nextStation(); // включає наступну станцію
        radio.play(); // radio HitFM paying...

        radio.nextStation(); // включає наступну станцію
        radio.play(); // radio Retro paying...

        radio.nextStation(); // включає наступну станцію
        // так як в нас тільки 3 станції, то знову включиться перша
        radio.play(); // radio UA paying...


    }
}
