package com.patternJava.structural.bridge.bridge_1;

/*
шаблон Міст ( Bridge )

============================================================================================
ціль:
    - відділити абстракцію від її реалізації таким чином, щоб ми могли змінювати незалежно
      як абстракцію так і реалізацію

============================================================================================
для чого використовується:
   - для отримання переваги наслідування без втрати гнучкості
     тобто коли ми наслідуємось, то ми жостко привязуємось
============================================================================================
приклад використання:
   - запобігти жосткої привязки абстракції до реалізації (наприклад, реалізацію потрібно вибрати під
      час виконання програми);
   - в майбутньому ми хочемо розширюватися з допомогою підкласів і реалізацію і абстракцію;
   - якщо зміни в реалізації не повинні відображатися на клієтах абстракції;
   - для розділення одної реалізації між кількома обєктами і не показувати це клієнту.

============================================================================================
 */
public class BridgeEx {
    public static void main(String[] args) {
        Program[] programs = {
                new BankSystem(new JavaDeveloper()),
                new StockExchange(new PhpDeveloper())
        };

        for (Program program: programs) {
            program.developProgram();
        }
    }
}
